# GetLayerByName

## Description
Returns a handle to the specified layer.

```pascal
FUNCTION GetLayerByName(layerName : STRING): HANDLE;
```

```python
def vs.GetLayerByName(layerName):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|layerName|STRING|Name of layer.|

## Version
Availability: from VectorWorks8.5

## Category
* Layers